app/views/users/index.html.erb

SELECT "users".* FROM "users"
---
      <tbody>
      <% @users = User.all %>