app/controllers/users_controller.rb

  def make_admin
    user = User.find params[:id]
    user.update_attribute :admin, true
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "users" SET "admin" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["admin", "t"], ["updated_at", "2016-09-16 03:28:49.984514"], ["id", 2]]

  def remove_admin
    user = User.find params[:id]
    user.update_attribute :admin, false
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "users" SET "admin" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["admin", "f"], ["updated_at", "2016-09-16 05:27:54.848501"], ["id", 1]]