app/controllers/users_controller.rb

  def toggle_admin
    @user = User.find params[:id]
    if @user.try(:admin?)
      @user.update_attribute :admin, false
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "users" SET "admin" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["admin", "t"], ["updated_at", "2016-09-16 05:46:04.186954"], ["id", 1]]